// service_data.dart
final Map<String, List<Map<String, String>>> serviceDetails = {
  'حجز في عيادة': [
    {'title': 'عيادة القلب', 'description': 'عيادة متخصصة في علاج أمراض القلب'},
    {
      'title': 'عيادة العيون',
      'description': 'عيادة متخصصة في علاج أمراض العيون'
    },
    {
      'title': 'عيادة الجلدية',
      'description': 'عيادة متخصصة في علاج أمراض الجلد'
    },
  ],
  'الاتصال بطبيب': [
    {'title': 'اتصال هاتفي', 'description': 'تواصل مع الطبيب عبر الهاتف'},
    {
      'title': 'مكالمة فيديو',
      'description': 'تواصل مع الطبيب عبر مكالمة فيديو'
    },
    {
      'title': 'رسالة نصية',
      'description': 'تواصل مع الطبيب عبر الرسائل النصية'
    },
  ],
  'صيدلية': [
    {'title': 'صيدلية قريبة', 'description': 'اعثر على صيدلية قريبة منك'},
    {'title': 'طلب دواء', 'description': 'اطلب الدواء الخاص بك عبر التطبيق'},
    {'title': 'تجديد الوصفة', 'description': 'جدد وصفتك الطبية بسهولة'},
  ],
  'أشعة وسونار': [
    {'title': 'أشعة إكس', 'description': 'إجراء أشعة إكس على العظام'},
    {'title': 'أشعة مقطعية', 'description': 'إجراء أشعة مقطعية'},
  ],
  'مختبرات': [
    {'title': 'تحاليل دم', 'description': 'تحاليل دم شاملة'},
    {'title': 'تحاليل خاصة', 'description': 'إجراء أشعة مقطعية'},
  ],
  'جراحات': [
    {'title': 'جراحة بسيطة', 'description': 'إجراء جراحة بسيطة'},
    {'title': 'جراحة متقدمة', 'description': 'إجراء جراحة متقدمة'},
  ],
  'علاج طبيعي': [
    {'title': 'علاج طبيعي', 'description': 'جلسات علاج طبيعي'},
  ],
  'زيارة منزلية': [
    {'title': 'زيارة طبيب عام', 'description': 'زيارة طبيب عام إلى المنزل'},
    {
      'title': 'زيارة طبيب أخصائي',
      'description': 'زيارة طبيب أخصائي إلى المنزل'
    },
    {'title': 'فحص منزلي', 'description': 'إجراء فحص طبي منزلي'},
  ],
  'تجميل': [
    {'title': 'حجز موعد بمركز تجميل', 'description': 'حجز موعد بمركز تجميل'},
  ],
};
